Autodesk.Revit.DB.TextAlignFlags
An enumerated type listing all the Text align flags.

Autodesk.Revit.DB.TextAlignFlags.TEF_ALIGN_BOTTOM
Align text bottom

Autodesk.Revit.DB.TextAlignFlags.TEF_ALIGN_MIDDLE
Align text middle

Autodesk.Revit.DB.TextAlignFlags.TEF_ALIGN_TOP
Align text top

Autodesk.Revit.DB.TextAlignFlags.TEF_ALIGN_RIGHT
Align text right

Autodesk.Revit.DB.TextAlignFlags.TEF_ALIGN_CENTER
Align text center

Autodesk.Revit.DB.TextAlignFlags.TEF_ALIGN_LEFT
Align text left